Microchip-MPLAB-Harmony/dev_packs/Microchip/SAME51_DFP/3.2.64/Microchip.SAME51_DFP.pdsc
      <condition id="ATSAME51J19A">
         <require Dvendor="Microchip:3" Dname="ATSAME51J19A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAME51J20A">
         <require Dvendor="Microchip:3" Dname="ATSAME51J20A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAME51G19A">
         <require Dvendor="Microchip:3" Dname="ATSAME51G19A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAME51G18A">
         <require Dvendor="Microchip:3" Dname="ATSAME51G18A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAME51N19A">
         <require Dvendor="Microchip:3" Dname="ATSAME51N19A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAME51N20A">
         <require Dvendor="Microchip:3" Dname="ATSAME51N20A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAME51J18A">
         <require Dvendor="Microchip:3" Dname="ATSAME51J18A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
   </conditions>
   <components>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.2.0" condition="ATSAME51J19A">
         <description>Headers and startup code for Microchip ATSAME51J19A</description>
         <files>
            <file condition="C" category="include" name="include"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_same51j19a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/system_same51j19a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/same51j19a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/same51j19a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/armcc/startup_same51j19a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/system_same51j19a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_same51j19a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_same51j19a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/iar/same51j19a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/iar/same51j19a_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.2.0" condition="ATSAME51J20A">
         <description>Headers and startup code for Microchip ATSAME51J20A</description>
         <files>
            <file condition="C" category="include" name="include"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_same51j20a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/system_same51j20a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/same51j20a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/same51j20a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/armcc/startup_same51j20a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/system_same51j20a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_same51j20a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_same51j20a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/iar/same51j20a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/iar/same51j20a_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.2.0" condition="ATSAME51G19A">
         <description>Headers and startup code for Microchip ATSAME51G19A</description>
         <files>
            <file condition="C" category="include" name="include"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_same51g19a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/system_same51g19a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/same51g19a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/same51g19a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/armcc/startup_same51g19a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/system_same51g19a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_same51g19a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_same51g19a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/iar/same51g19a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/iar/same51g19a_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.2.0" condition="ATSAME51G18A">
         <description>Headers and startup code for Microchip ATSAME51G18A</description>
         <files>
            <file condition="C" category="include" name="include"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_same51g18a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/system_same51g18a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/same51g18a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/same51g18a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/armcc/startup_same51g18a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/system_same51g18a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_same51g18a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_same51g18a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/iar/same51g18a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/iar/same51g18a_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.2.0" condition="ATSAME51N19A">
         <description>Headers and startup code for Microchip ATSAME51N19A</description>
         <files>
            <file condition="C" category="include" name="include"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_same51n19a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/system_same51n19a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/same51n19a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/same51n19a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/armcc/startup_same51n19a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/system_same51n19a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_same51n19a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_same51n19a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/iar/same51n19a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/iar/same51n19a_sram.icf" attr="config"/>
         </files>
      </component>
