Microchip-MPLAB-Harmony/dev_packs/Microchip/SAME51_DFP/3.2.64/Microchip.SAME51_DFP.pdsc
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.2.0" condition="ATSAME51N20A">
         <description>Headers and startup code for Microchip ATSAME51N20A</description>
         <files>
            <file condition="C" category="include" name="include"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_same51n20a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/system_same51n20a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/same51n20a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/same51n20a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/armcc/startup_same51n20a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/system_same51n20a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_same51n20a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_same51n20a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/iar/same51n20a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/iar/same51n20a_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.2.0" condition="ATSAME51J18A">
         <description>Headers and startup code for Microchip ATSAME51J18A</description>
         <files>
            <file condition="C" category="include" name="include"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_same51j18a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/system_same51j18a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/same51j18a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/same51j18a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/armcc/startup_same51j18a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/system_same51j18a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_same51j18a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_same51j18a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/iar/same51j18a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/iar/same51j18a_sram.icf" attr="config"/>
         </files>
      </component>
   </components>
</package>
